Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: Das verhindert, dass 'Branches' vom entfernten 'Repository' Deine lokalen 'Branches' stören und es macht Git einfacher für Anfänger.
pl: To zapobiega temu, że branches z oddalonego repozytorium nie przeszkadza twoim lokalnym branches i czyni to Git łatwiejszym dla początkujących.

source: Das war eine Schande, denn vielleicht war deine vorherige Sicherung an einer außergewöhnlich spannenden Stelle des Spiels, zu der du später gerne noch einmal zurückkehren möchtest.
pl: To była hańba, bo być może poprzednio zabezpieczony stan był w jakimś bardzo interesującym miejscu gry, do którego chętnie chciałbyś jeszcze wrócić.

source: Das wendet den eingegangenen 'Patch' an und erzeugt einen 'Commit', inklusive der Informationen wie z.B. den Autor.
pl: Patch zostanie wprowadzony i utworzy commit, włącznie z informacjami jak naprzykład o autorze.

source: Das wirft die Frage auf: Welchen 'Commit' referenziert `HEAD~10` tatsächlich?
pl: To nasuwa pytanie; ktoremu 'commit' referuje HEAD++10 wlasciwie?

source: Dass, wenn der Chef ins Büro spaziert, während du das Spiel spielst, du es schnell verstecken kannst?
pl: By, jesli tylko szef wszedl do biura, podczas grania w gierke, mogles ja szybko ukryc?

source: Dateien herunterladen
pl: Zładowanie danych

source: Dateien ohne Bezug
pl: Pliki z brakiem odniesienia

source: Dateien sind können schreibgeschützt sein, bis Du einem zentralen Server mitteilst, welche Dateien Du gerne bearbeiten möchtest.
pl: Pliki mogą być zapezpieczone przed zapisem, aż do momentu gdy uda ci się poinformować centralny serwer o tym, że chciałabyś nad nimi popracować.

source: Dateihistorie
pl: Historia pliku

source: Dein Arbeitsverzeichnis erscheint wieder exakt in dem Zustand wie es war, bevor du anfingst zu editieren.
pl: Twój katalog roboczy wygląda dokładnie tak, jak wyglądał zanim zacząłeś w nim edytować

source: Deine Arbeit kommt zum Stillstand, wenn das Netzwerk oder der zentrale Server weg sind.
pl: Gdy tylko zniknie sieć lub centralny serwer praca staje.

source: Deine Dateien können sich verwandeln, vom aktuellsten Stand, zur experimentellen Version, zum neusten Entwicklungsstand, zur Version deines Freundes und so weiter.
pl: Twoje dane moga zamienic sie z aktualnego stanu do wersji eksperymentalnej, do najnowszego stanu, do stanu twojeo kolegi i tak dalej.

source: Deine Nutzer werden nie mit Versionen in Kontakt kommen, von denen du es nicht willst.
pl: Twoi uzytkownicy nigdy nie wejda w posiadanie wersji, ktorych nie chcesz by posiadali

source: Den Gedankengang zu unterbrechen ist schlecht für die Produktivität und je komplizierter der Kontextwechsel ist, desto größer ist der Verlust.
pl: Przerwanie mysli nie jest dobre dla produktywnosci, a czym bardziej skomplikowana zmiana kontekstu, tym wieksze sa straty

source: Der Absender erstellt ein 'Bundle':
pl: Nadawca tworzy 'bundle':

source: Der Dateiname ist irrelevant: nur der Dateiinhalt wird zum Erstellen des 'Blob'-Objekt verwendet.
pl: Nazwa pliku nie ma znaczenia, jedynie jego zawartość służy do utworzenia objektu 'blob'.

source: Der Empfänger kann das sogar mit einem leeren 'Repository' tun.
pl: Odbiorca może to zrobić z pustym repozytorium.

source: Der HEAD Bezeichner ist wie ein Cursor, der normalerweise auf den jüngsten 'Commit' zeigt und mit jedem neuen 'Commit' voranschreitet.
pl: Identyfikator 'HEAD' zachowuje się jak kursor, który zwykle wskazuje na najmłodszy 'commit' i z każdym nowym 'commit' zostaje przesunięty.

source: Der Index ist ein temporärer Bereitstellungsraum.
pl: Index jest tymczasowym rusztowaniem

source: Der Index: Git's Bereitstellungsraum
pl: Index: ruszkowanie gita

source: Der Inhalt von +.git/objects+ bleibt der selbe, ganz egal wieviele Dateien Du hinzufügst.
pl: Zawartość +.git/objects+ nie zmieni się, niezależnie ile kopii dodałaś.

source: Der SHA1-Hash-Wert wird während eines 'Commit' aktualisiert, genauso bei vielen anderen Anweisungen.
pl: Klucz SHA1 zostaje aktualizowany podczas wykonania 'commit', tak samo jak i przy wielu innych poleceniach.

source: Der Unterschied zwischen A und B sind die gelöschten Dateien.
pl: Roznica miedzy A i B, to skasowane pliki.

source: Der Verlauf der Firmware interessiert den Anwender nicht und Änderungen lassen sich schlecht komprimieren, so blähen Firmwarerevisionen die Größe des 'Repository' unnötig auf.
pl: Historia pliku firmware nie interesuje użytkownika, a zmiany nie pozwalają sie wygodnie komprymować, wielkość repozytorium wzrasta niepotrzebnie o nowe wersje binarnego pliku firmware.

source: Der ``master'' 'Branch' ist ein nützlicher Brauch.
pl: MASTER BRANCH jest bardzo użytecznym

source: Der `master` Branch enthält nun Teil I, und der `teil2` Branch enthält den Rest.
pl: Teraz 'master branch' zawiera cześć 1 a 'branch' czesc2 posiada resztę.

source: Der aktuelle HEAD wird in der Datei +.git/HEAD+ gehalten, welche den SHA1-Hash-Wert eines 'Commit'-Objekts enthält.
pl: Aktualny HEAD przetrzymywany jest w pliku +.git/HEAD+, która posiada klucz SHA1 ostatniego 'commit'.

source: Der angegebene Pfad wird stillschweigend überschrieben.
pl: Podana ścieżka zostanie bez pytania zastąpiona.

source: Der erste Schritt erstellt einen Schnappschuß des aktuellen Status jeder überwachten Datei im Index.
pl: Pierwszy krok to stworzenie zrzutu bieżącego statusu każdego monitorowanego pliku w indeksie.

source: Der erster Klon
pl: Pierwszy klon

source: Der ganze Beitrag ist eine faszinierende archäologische Seite für Git Historiker.
pl: Cały post jest archeologicznie fascynującą stroną dla historyków zajmujących sie Gitem.

source: Der initiale Aufwand lohnt sich aber auf längere Sicht, da die meisten zukünftigen Operationen dann schnell und offline erfolgen.
pl: Początkowy koszt spłaca sie jednak na dłuższą metę ponieważ większość przyszłych operacji przeprowadzane są szybko i offline.

source: Der zweite Schritt speichert dauerhaft den Schnappschuß, der sich nun im Index befindet.
pl: Drugim krokiem jest trwałe zapamiętanie zrzutu, który znajduje się w index.

source: Der zweite Teil eines Leistungsmerkmals muss warten, bis der erste Teil veröffentlicht und getestet wurde.
pl: Druga czesc jakiegos feature musi czekac, az pierwsza zostanie upubliczniona i przetestowana.

source: Die *-z* und *-0* Optionen verhindern unerwünschte Nebeneffekte durch Dateinamen mit ungewöhnlichen Zeichen.
pl: Opcje *-z* i *-0* zapobiegą przed niechcianymi efektmi ubocznymi przed niestandardowymi znakami w nazwach plików

source: Die *pull* Anweisung holt ('fetch') eigentlich die 'Commits' und verschmilzt ('merged') diese dann mit dem aktuellen 'Branch'.
pl: Polecenie *pull* ładuje ('fetch') 'commits' i je zespala ('merge'), wtedy z aktualnym 'branch'.

source: Die +branch.master.merge+ Option definiert den Standard-Remote-'Branch' bei einem *git pull*.
pl: Opcja +branch.master.merge+ definuje standardowy Remote-'Branch' dla *git pull*.

source: Die +remote.origin.url+ Option kontrolliert die Quell-URL; ``origin'' ist der Spitzname, der dem Quell-'Repository' gegeben wurde.
pl: Opcja +remote.origin.url+ kontroluje źródłowe URL; ``origin'' to alias, nadany źródłowemu repozytorium.

source: Die Anweisung
pl: Polecenie:

source: Die Anweisung *git fast-export* konvertiert jedes 'Repository' in das *git fast-import* Format, diese Ausgabe kannst du studieren um Exporteure zu schreiben und außerdem um 'Repositories' in Klartext zu übertragen.
pl: Polecenie *git fast-export* konwertuje każde repozytorium do formatu *git fast-import*, możesz przestudiować komunikaty tego polecenia, jeśli masz zamiar napisaś programy eksportujące a oprócz tego, by przekazywać repozytoria jako zwykłe pliki tekstowe.

source: Die Chef-Taste
pl: Przycisk SZEF

source: Die Datei zu löschen ist zwecklos, da über ältere 'Commits' auf sie zugegriffen werden könnte.
pl: Skasowanie tej danej nie ma sensu, ponieważ poprzez starsze 'commits' można nadal ją przywołać.

source: Die Entwicklung findet in den 'Clonen' statt, so kann das Heim-'Repository' ohne Arbeitsverzeichnis auskommen.
pl: Sama praca dzieje się w klonach projektu, w ten sposób domowe-REPOSITORY daje sobie radę nie korzystając z katalogu roboczego

source: Die Erweiterung kann auch ein Mercurial 'Repository' in ein Git 'Repository' umwandeln, indem man in ein leeres 'Repository' 'pushed'.
pl: To rozszerzenie potrafi również zmienić skład Mercurial w skład GIT, za pomocą komendy PUSH do pustego składu GIT

source: Die Frist für ein bestimmtes Leistungsmerkmal rückt näher.
pl: Termin opublikowania pewnej wlasciwosci zbliza sie.

source: Die Hilfeseiten schlagen vor 'Tags' zu benutzen um dieses Problem zu lösen.
pl: Strony pomocy zalecają stosowanie tagów, by rozwiązać ten problem.

source: Die Nachteile sind üblicherweise gering und werden gern in Kauf genommen, da andere Operationen dafür unglaublich effizient sind.
pl: Te wady są w wieszości przypadków marginalne i nie są brane pod uwagę, ponieważ inne operacje są bardzo wydajne.

source: Die Objektdatenbank
pl: Obiektowa baza danych

source: Die Objektdatenbank ist einfach aber trotzdem elegant und sie ist die Quelle von Git's Macht.
pl: Obiektowa baza danych jest prosta, mimo to jesnak elegancka i jest źródłem siły Gita.

source: Die Objektdatenbank ist immun gegen unerwartete Unterbrechungen wie zum Beispiel einen Stromausfall.
pl: Objektowa baza dynch jest osporna na nieoczekiwane przerwy, jak na przykład przerwanie dostawy prądu.

source: Die Platzersparnis beruht auf dem Speichern der Unterschiede an Stelle einer Kopie der ganzen Datei.
pl: Oszczędność miejsca na dysku polega głównie na zapamiętywaniu jedynie różnic, a nie kopii całego pliku.

source: Die SHA1-Hash-Wert Prüfung mit 'cat-file' ist etwas kniffliger, da dessen Ausgabe mehr als die rohe unkomprimierte Objektdatei enthält.
pl: Sprawdzanie za pomocą 'cat-file' jest troszeczkę kłopotliwe, bo jego output zawiera więcej niż tylko nieskomprymowany objekt pliku.

source: Die Summe der Bemühungen verschlimmerte die Überlastungen, was einzelne wiederum ermutigte noch mehr Bandbreite zu verbrauchen um noch längere Wartezeiten zu verhindern.
pl: Suma tych starań pogarsza tylko przeciążenia, co motywuje jednostki do zużywania jeszcze większych zasobów, by ochronić się przed jeszcze dłuższymi czasami ozekiwania.

source: Die Textdatei ist wiederhergestellt.
pl: Poprzedni plik jest przywrocony do stanu pierwotnego

source: Die Ursachen für die großen Unterschiede sollten ermittelt werden.
pl: Powinno się w takim wypadku szukać powodów wystąpienia największych zmian.

source: Die Vorgehensweise, wie du deine Änderungen den anderen übergibst, hängt vom anderen Versionsverwaltungssystem ab.
pl: Sposób w jaki przekaższ zmiany drugiemu systemowi zależy już od niego.

source: Die aktuelle Implementierung von Git, weniger sein Design, ist verantwortlich für diesen Pferdefuß.
pl: To raczej obecna implementacja Git, a mniej jego konstrukcja, jest odpowiedzialna za to wadę.

source: Die aktuellste Version des Projekts kannst du abrufen ('checkout') mit:
pl: Aktualną wersję projektu możesz przywołać ('checkout') poprzez:

source: Die allererste Git Hosting Seite.
pl: Pierwsza powstała strona hostingowa dla Git.

source: Die beschriebene Situation ist eine erwähnenswerte Ausnahme.
pl: Ta przywołana sytuacja jest wyjątkiem wartym wspomnienia.

source: Die einfachsten Befehle werden bis zum Schneckentempo verlangsamt, wenn die Anzahl der Anwender steigt.
pl: Przy wzroście liczby użytkowników nawet najprostsze polecenia stają się wolne jak ślimak.

source: Die ersten paar Zeichen eines Hashwert reichen aus um einen 'Commit' zu identifizieren; alternativ benutze kopieren und einfügen für den kompletten Hashwert.
pl: Pierwsze kilka znakow hash wystarcza by jednoznacznie zidentyfikowac 'commit'; alternatywnie mozesz wkopiowac caly hash.

source: Die letztere kann verwendet werden um SHA1-Werte von 'Commits' zu finden, die sich in einem 'Branch' befanden, der versehentlich gestutzt wurde.
pl: Ostatnie możemy zastosować do odnalezienia kluczy SHA1 tych 'commits' które znajdowały się w nieuważnie usuniętym 'branch'.

source: Die meisten Leute verbinden mit Kryptographie die Geheimhaltung von Informationen, aber ein genau so wichtiges Ziel ist es Informationen zu sichern.
pl: Z kryptografią przez większość ludzi łączona jest poufność informacji, jednak równie ważnym jej celem jest zabezpieczenie danych.

source: Die meisten Systeme wählen automatisch eine vernünftige Vorgehensweise: akzeptiere beide Änderungen und füge sie zusammen, damit fließen beide Änderungen in das Dokument mit ein.
pl: Większość systemów wybierze automatycznie rozsądną drogę: zaakceptuje obie zmiany i połączy je ze sobą, tym samym obje poprawki wpłyną do dokumentu.

source: Die neue Generation der Versionsverwaltungssysteme, zu denen Git gehört, werden verteilte Systeme genannt und können als eine Verallgemeinerung der zentralisierten Systeme verstanden werden.
pl: Nowa generacja systemów kontroli wersji, do których należy również git, nazywana jest systemami rozproszonymi i mogą być rozumiane jako uogólnienie systemów scentralizowanych.

source: Die reflog Anweisung bietet eine benutzerfreundliche Schnittstelle zu diesen Logdateien.
pl: Polecenie 'reflog' daje nam do dyspozycji przyjazny interfejs do tych właśnie logów.

source: Die resultierenden Dateien können an *git-send-email* übergeben werden oder von Hand verschickt werden.
pl: Uzyskane w ten sposób dane mogą przekazane być do *git-send-mail* albo odręcznie wysłane.

source: Die richtige Anwendung von kryptographischen Hash-Funktionen kann einen versehentlichen oder bösartigen Datenverlust verhindern.
pl: Właściwe zastosowanie kraptograficznych funkcji hashujących (funkcji skrótu) może uchronić przed nieumyślnym lub celowym zniszczeniem danych.

source: Die vergangenen 'Commits' wissen nichts von der Zukunft.
pl: Poprzednie 'commits' nic nie wiedzą o jej istnieniu.

source: Die wirklich Paranoiden sollten immer den letzten 20-Byte SHA1 Hash des 'HEAD' aufschreiben und an einem sicheren Ort aufbewahren.
pl: Ci najbardziej paranoidalni powinni zawsze zapisać 20 bajtów SHA1 hash z HEAD i przechowywać na bezpiecznym miejscu

source: Die zweite Person, welche die Datei hoch lädt, wird über einen _'Merge' Konflikt_ informiert und muss entscheiden, welche Änderung übernommen wird oder die ganze Zeile überarbeiten.
pl: Druga z osób, próbująca zładować dokument na serwer, zostanie poinformowana o wystąpieniu konfliktu 'merge' i musi zdecydować, która ze zmian zostanie przyjęta lub ponownie zrewidować całą linijkę.

source: Die Änderungen bleiben im .git Unterverzeichnis gespeichert und können wieder hergestellt werden, wenn der entsprechende SHA1-Wert aus `.git/logs` ermittelt wird (siehe "KOPF-Jagd" oben).
pl: Zmiany te zostaną zapisane w podkatalogu .git i mogą znów zostać przywrócone, jeśli znajdziemy odpowiedni kluch SHA1 w `.git/logs` (zobacz "Łowcy głów" powyżej).

source: Die, welche dir am besten gefällt.
pl: To, ktore najbardziej tobie odpowiada.

source: Dies holt lediglich die Chroniken.
pl: Polecenie to załaduje jedynie historię

source: Dies ist erstrebenswert, denn der aktuelle 'Branch' wird zum ersten Elternteil während eines 'Merge'; häufig bist du nur von Änderungen betroffen, die du im aktuellen 'Branch' gemacht hast, als von den Änderungen die von anderen 'Branches' eingebracht wurden.
pl: Należy wspomnieć, że aktualny 'branch' staje sie pierwszym rodzicem podczas 'merge'; czesto jestes konfrontowany ze zmianami ktorych dokonales w aktualnym 'branch' bardziej, niz ze zmianami z innych 'branch'.

source: Dies verleiht ihnen eine universelle Anziehungskraft.
pl: Dodaje im to uniwersalnej mocy przyciągania.

source: Diese Anleitung ist unter der http://www.gnu.org/licenses/gpl-3.0.html[GNU General Public License Version 3] veröffentlicht.
pl: Ten poradnik publikowany jest na bazie licencji http://www.gnu.org/licenses/gpl-3.0.html[GNU General Public License Version 3].

source: Diese Datei ist ein 'Tree'-Objekt: eine Liste von Datensätzen, bestehend aus dem Dateityp, dem Dateinamen und einem SHA1-Hash-Wert.
pl: Nasz plik to takzwany objekt 'tree': lista wyrażeń, na którą składają się rodzaj pliku, jego nazwa i jego klucz SHA1.

source: Diese Liste zeigt die 'Branches' und den HEAD des entfernten 'Repository', welche auch in regulären Git Anweisungen verwendet werden können.
pl: Lista ta ukazje BRANCHES i HEAD odległego repozytorium, które mogą być również stosowane w zwykłych poleceniach Git.

source: Diese Operationen sind schnell und lokal, also warum nicht damit experimentieren um die beste Kombination für sich selbst zu finden?
pl: Obie operacje są szybkie i lokalne, dlaczego nie poeksperymentować i nie znaleźć dla siebie najbardziej odpowiedniej kombinacji.

source: Diese Option gilt nur für das 'Repository', von dem als erstes 'gecloned' wurde, was in der Option +branch.master.remote+ hinterlegt ist.
pl: Ta opcja jest ważna jedynie dla repozytorium, z którego dokonało się pierwsze klonowanie, co zapisane jest w opcji +branch.master.remote+.

source: Diese Spiele versteckten die Details vor dem Spieler und präsentierten eine bequeme Oberfläche um verschiedene Versionen des Ordners zu verwalten.
pl: Gry ukrywały szczegóły przed graczem i prezentowały wygodny interfejs, do zarządzania różnymi wersjami katalogu.

source: Diese Verwandlung kann mehr als nur in der Geschichte vor und zurück gehen.
pl: Te przemiany moga wiecej jak tylko poruszanie sie w historii projektu.

source: Diese alternative Realität heißt 'Branch' und <<branch,wir kommen später darauf zurück>>.
pl: Ta inna rzeczywistość, to tzw. branch <<branch, zajmiemy się tym w późniejszym czasie>>.

source: Diese einfache Beobachtung ist überraschend nützlich: suche nach 'hash chains'.
pl: Ta prosta obserwacja okazała się niesamowicie pożyteczna: jeśli cię to zainteresowało poszukaj informacji na temat 'hash chains'.

source: Dieser Zyklus wiederholt sich ein paar Mal bevor du zum 'Pushen' in den zentralen Zweig bereit bist.
pl: Ten cykl powtarza się kilka razy zanim jesteś gotowy na 'push' do centralnego drzewa.

source: Dieser http://lkml.org/lkml/2005/4/6/121['Linux Kernel Mailing List' Beitrag] beschreibt die Kette von Ereignissen, die zu Git geführt haben.
pl: Ten http://lkml.org/lkml/2005/4/6/121['Linux Kernel Mailing List' post] opisuje cały łańcuch zdarzeń, które inicjowały powstanie Git.

source: Dieser spezielle 'Commit' repräsentiert einen leeren 'Tree', ohne Eltern, irgendwann vielleicht der Vorfahr aller Git 'Repositories'.
pl: Ten specjalny 'commit' reprezentuje puste drzewo, bez rodziców, być może pradziad wszystkich repozytorii

source: Dieses erste 'Cloning' kann teuer sein, vor allem, wenn eine lange Geschichte existiert, aber auf Dauer wird es sich lohnen.
pl: Pierwszy klon może być drogi, przede wszystkim, jeśli posiada długą historię, ale na dłuższy okres opłaci się.

source: Dieses mal kann ich Dir nicht sagen, wie die zwei neuen Dateien heißen, weil es zum Teil vom gewählten Dateiname abhängt, den Du ausgesucht hast.
pl: Tym razem nie jestem w stanie powiedzieć, jak nazywają sie te dwa nowe pliki, ponieważ częściowo są zależne od nazwy jaką nadałeś plikom.

source: Doch anstelle ein paar Knöpfe zu drücken, machst du 'create', 'check out', 'merge' und 'delete' von temporären 'Branches'.
pl: Lecz zamiast naciskać guziki, dajesz polecenia CREATE, CHECK OUT, MERGE i DELETE z tymczasowymi BRANCHES.

source: Doch das 'Clonen' bringt das Kopieren des gesamten Arbeitsverzeichnis wie auch die ganze Geschichte bis zum angegebenen Punkt mit sich.
pl: Jednak 'clone' niesie za soba kopiowanie calego katalogu roboczego jak i calej historii projektu az do podanego punktu.

source: Du arbeitest also an Teil II und 'commitest' deine Änderungen regelmäßig.
pl: Pracujesz w cześci 2 i regularnie wykonujesz 'commit'.

source: Du arbeitest an einem aktiven Projekt.
pl: Pracujesz nad aktywnym projektem.

source: Du bekommst einen Haufen Dateien eines bestimmten Sicherungsstands.
pl: Otrzymasz całą masę plików konkretnego stanu

source: Du denkst, du kannst das besser?
pl: Uważasz, że potrafisz to lepiej

source: Du hast auch noch andere Optionen, z.B. den Aufschub der Entscheidung; drücke "?"
pl: Dysponujesz jeszcze innymi opcjami, na przykład dla odłożenie w czasie decyzji; naciśnij "?"

source: Du hast die absolute Kontrolle über das Schicksal Deiner Dateien, denn Git kann jederzeit einfach einen gesicherten Stand aus `.git` wiederherstellen.
pl: Posiadasz absolutną kontrolę nad losem twoich danych, ponieważ Git potrafi dla ciebie w każdej chwili odtworzyć zapamiętany poprzednio stan z właśnie podkatalogu .git.

source: Du hast gerade ein Funktion in deiner Anwendung entdeckt, die nicht mehr funktioniert und du weißt sicher, dass sie vor ein paar Monaten noch ging.
pl: Właśnie znalazłeś w swoim programie funkcję, która już nie chce działać, a jesteś pewna, że czyniła to jeszcze kilka miesięcy temu.

source: Du kannst Dir alle SHA1-Werte in `.git/objects` vornehmen und ausprobieren ob Du den gesuchten 'Commit' findest.
pl: Możesz po kolei testować wszystkie klucze SHA1 w `.git/objects` i w ten sposób próbować odnaleźć szukany 'commit'

source: Du kannst auch 'Commits' aufteilen.
pl: Możesz również podzielć 'commits'.

source: Du kannst auch eine Gruppe von 'Commits' angeben:
pl: Możesz podać grupę 'commits'

source: Du kannst auch nach dem 5. letzten 'Commit' fragen:
pl: Możesz również udać się do 5 z ostatnich COMMIT:

source: Du kannst auch nur einzelne Dateien oder Verzeichnisse wiederherstellen indem du sie an den Befehl anhängst:
pl: Jeśłi chcesz, możesz przywołać jedynie wybrane pliki lub katalogi poprzez dodanie ich nazw do polecenia

source: Du kannst den Zustand des Ordners sichern so oft du willst und du kannst später jeden Sicherungspunkt wieder herstellen.
pl: Możesz archiwizować stan katalogu tak często jak często chcesz i później możesz do każdego z tych punktów powrócić.

source: Du kannst die Logs nach dem entsprechenden SHA1 Hashwert durchsuchen, aber es ist viel einfacher folgendes einzugeben:
pl: Możesz przeszukać logi za odpowiednim kluczem SHA1, ale dużo prościej jest podać:

source: Du kannst die Nummer für den ersten Elternteil weglassen.
pl: Mozesz pominac numer pierwszego rodzica

source: Du kannst diese Notation mit anderen Typen kombinieren.
pl: Mozesz łączyć ta notacje takze z innymi

source: Du kannst diese Änderungen sogar 'commiten'.
pl: Mozesz te zmiany nawet 'commit'.

source: Du kannst einen 'Patch' Entwicklern schicken, ganz egal, was für ein Versionsverwaltungssystem sie benutzen.
pl: Możesz wysłać patch prowadzącym projekt, niezależnie od tego, jakiego używają systemu kontroli wersji.

source: Du kannst einen bestimmten Elternteil mit einem Caret-Zeichen referenzieren.
pl: Mozesz tez jakiegos rodzica referowac go daszkiem.

source: Du kannst mehrere 'stashes' haben und diese unterschiedlich handhaben.
pl: Możesz posiadać więcej STASHES i traktować je w zupełnie inny sposób.

source: Du kannst noch viel mehr machen: die Hilfe erklärt, wie man 'bisect'-Operationen visualisiert, das 'bisect'-Log untersucht oder wiedergibt und sicher unschuldige Änderungen ausschließt um die Suche zu beschleunigen.
pl: Możesz robić jeszcze dużo innych rzeczy: w pomocy znajdziesz w jaki sposób wizualizować działania 'bisect', które ..............

source: Du kannst nun an zwei unabhängigen Funktionen gleichzeitig arbeiten.
pl: Możesz pracować nad dwoma funkcjami jednocześnie

source: Du kannst sogar 'Branches' in einem 'Repository' umorganisieren.
pl: Możesz nawet przeorganizować 'branches' w repozytorium.

source: Du kannst sogar die frisch gebackene Fehlerkorrektur auf Deinen aktuellen Stand übernehmen:
pl: Mozesz nawet ostatnio swiezo upieczona koreketure przejac do aktualnego stanu:
